tutorials/2dChannelKink/0/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{


    inlet
    {
      //   type               interstitialInletVelocity;
      //   type               fixedValue;
           type              zeroGradient;  
      // inletVelocity      uniform (-0.01 0 0);
       //  alpha              alpha.particles;
         value              uniform (0 0 0);
    }

    outlet
    {
//        type               pressureInletOutletVelocity;
        type               inletOutlet;
        value              $internalField;
        phi                phi.particles;
        inletValue              $internalField;
    }

    walls
    {
        type             slip;
    }

    frontAndBackPlanes
    {
        type               empty;
    }

    symm
    {
         type           symmetryPlane;
    }
}

// ************************************************************************* //
